In [1]:
%load_ext sql

In [37]:
%sql sqlite:///prueba.db

In [3]:
%sql sqlite:///create-read-update-deleate.db

#### **ELiminar tablas** ####

In [4]:
%%sql
CREATE TABLE uno(
    dato INT
)

 * sqlite:///create-read-update-deleate.db
   sqlite:///prueba.db
Done.

[]

In [5]:
%sql SELECT * from uno

 * sqlite:///create-read-update-deleate.db
   sqlite:///prueba.db
Done.

[]

In [6]:
%sql DROP TABLE uno

 * sqlite:///create-read-update-deleate.db
   sqlite:///prueba.db
Done.

[]

In [7]:
%%sql
SELECT name
FROM sqlite_master
WHERE type="table"

 * sqlite:///create-read-update-deleate.db
   sqlite:///prueba.db
Done.

[]

##### Working Table ####

In [11]:
%%sql
CREATE TABLE cats(
    cat_id INT PRIMARY KEY,
    name VARCHAR(100),
    breed VARCHAR(100),
    age INT
);

 * sqlite:///create-read-update-deleate.db
   sqlite:///prueba.db
(sqlite3.OperationalError) table cats already exists
[SQL: CREATE TABLE cats(
    cat_id INT PRIMARY KEY,
    name VARCHAR(100),
    breed VARCHAR(100),
    age INT
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [12]:
%%sql
INSERT INTO cats (cat_id,name,breed,age)
VALUES
(1,"ringo","taby",4),
(2,"cindy","maine coon",10),
(3, "dumbedore", "maine coon",11),
(4, "egg", "persian",4),
(5, "mysty", "taby",13),
(6, "george michel", "ragdol", 9),
(7, "jacson", "sphynx",7);

 * sqlite:///create-read-update-deleate.db
   sqlite:///prueba.db
7 rows affected.

[]

In [13]:
%sql SELECT * FROM cats

 * sqlite:///create-read-update-deleate.db
   sqlite:///prueba.db
Done.

[(1, 'ringo', 'taby', 4),
 (2, 'cindy', 'maine coon', 10),
 (3, 'dumbedore', 'maine coon', 11),
 (4, 'egg', 'persian', 4),
 (5, 'mysty', 'taby', 13),
 (6, 'george michel', 'ragdol', 9),
 (7, 'jacson', 'sphynx', 7)]

#### **SELECT** ####

In [15]:
#Give me all the columns
%sql SELECT * FROM Cats

 * sqlite:///create-read-update-deleate.db
   sqlite:///prueba.db
Done.

[(1, 'ringo', 'taby', 4),
 (2, 'cindy', 'maine coon', 10),
 (3, 'dumbedore', 'maine coon', 11),
 (4, 'egg', 'persian', 4),
 (5, 'mysty', 'taby', 13),
 (6, 'george michel', 'ragdol', 9),
 (7, 'jacson', 'sphynx', 7)]

In [16]:
#Select only one Colum
%sql SELECT name FROM cats

 * sqlite:///create-read-update-deleate.db
   sqlite:///prueba.db
Done.

[('ringo',),
 ('cindy',),
 ('dumbedore',),
 ('egg',),
 ('mysty',),
 ('george michel',),
 ('jacson',)]

In [17]:
#Select several columns

%sql SELECT name, age FROM cats

 * sqlite:///create-read-update-deleate.db
   sqlite:///prueba.db
Done.

[('ringo', 4),
 ('cindy', 10),
 ('dumbedore', 11),
 ('egg', 4),
 ('mysty', 13),
 ('george michel', 9),
 ('jacson', 7)]

#### **WHERE** ####

In [19]:
%sql SELECT name, age FROM cats WHERE age = 4;

 * sqlite:///create-read-update-deleate.db
   sqlite:///prueba.db
Done.

[('ringo', 4), ('egg', 4)]

In [23]:
%sql SELECT name, age FROM cats WHERE age > 4;

 * sqlite:///create-read-update-deleate.db
   sqlite:///prueba.db
Done.

[('cindy', 10),
 ('dumbedore', 11),
 ('mysty', 13),
 ('george michel', 9),
 ('jacson', 7)]

In [24]:
%sql SELECT * FROM cats WHERE cat_id = age;

 * sqlite:///create-read-update-deleate.db
   sqlite:///prueba.db
Done.

[(4, 'egg', 'persian', 4), (7, 'jacson', 'sphynx', 7)]

#### **ALIAS** ####

In [26]:
%sql SELECT name AS gatitos FROM cats

 * sqlite:///create-read-update-deleate.db
   sqlite:///prueba.db
Done.

[('ringo',),
 ('cindy',),
 ('dumbedore',),
 ('egg',),
 ('mysty',),
 ('george michel',),
 ('jacson',)]

#### **UPDATE** ####

In [27]:
%%sql
UPDATE cats SET breed = "shortair"
WHERE breed = "taby";

 * sqlite:///create-read-update-deleate.db
   sqlite:///prueba.db
2 rows affected.

[]

In [28]:
%sql SELECT * FROM cats

 * sqlite:///create-read-update-deleate.db
   sqlite:///prueba.db
Done.

[(1, 'ringo', 'shortair', 4),
 (2, 'cindy', 'maine coon', 10),
 (3, 'dumbedore', 'maine coon', 11),
 (4, 'egg', 'persian', 4),
 (5, 'mysty', 'shortair', 13),
 (6, 'george michel', 'ragdol', 9),
 (7, 'jacson', 'sphynx', 7)]

**Seleccionar varios update**
```sql
UPDATE cats SET breed = "cocoyo", name = "ringo";

In [30]:
%%sql
UPDATE cats SET age = 14
WHERE name = "mysty";

 * sqlite:///create-read-update-deleate.db
   sqlite:///prueba.db
1 rows affected.

[]

In [32]:
%sql SELECT * FROM cats;

 * sqlite:///create-read-update-deleate.db
   sqlite:///prueba.db
Done.

[(1, 'ringo', 'shortair', 4),
 (2, 'cindy', 'maine coon', 10),
 (3, 'dumbedore', 'maine coon', 11),
 (4, 'egg', 'persian', 4),
 (5, 'mysty', 'shortair', 14),
 (6, 'george michel', 'ragdol', 9),
 (7, 'jacson', 'sphynx', 7)]

#### **DELETE** ####

Borra todas las filas
```sql
DELETE FROM cats

In [35]:
#Ten cuidado con las comillas, se tulizan mas para columnas las dobre usa de preferencia las sencilas
%sql DELETE FROM cats WHERE name = 'egg';

 * sqlite:///create-read-update-deleate.db
   sqlite:///prueba.db
1 rows affected.

[]

In [36]:
%sql SELECT * FROM cats;

 * sqlite:///create-read-update-deleate.db
   sqlite:///prueba.db
Done.

[(1, 'ringo', 'shortair', 4),
 (2, 'cindy', 'maine coon', 10),
 (3, 'dumbedore', 'maine coon', 11),
 (5, 'mysty', 'shortair', 14),
 (6, 'george michel', 'ragdol', 9),
 (7, 'jacson', 'sphynx', 7)]

``` DELETE FROM cats;